/* 
Приклади роботи з транзакціями
*/

/*
Transactions – це
1) ділові угоди
2) послідовність операцій із БД
3) зміни БД в оперативній пам'яті
4) попередня зміна бази даних на диску у файлі журналювання
5) остаточна зміна бази даних на диску
*/

/*
Стан транзакцій
1) Початковий: транзакція автоматично починається після встановлення з'єднання (connect);
2) Активний: виконання будь-яких SQL-операторів
3.1) Фіксація: виконання команди COMMIT
3.2) Скасування: виконання команди ROLLBACK
*/

/*
Базові команди управління станами:
COMMIT – команда фіксації (перенесення) на диск усіх змін, виконаних операціями транзакції
ROLLBACK – команда скасування в оперативній пам'яті всіх змін, які здійснили операції транзакції
*/

SET LINESIZE 2000
SET PAGESIZE 100

-- Транзакція 1 складається із двох послідовних операцій
-- та операції переходу в кінцевий стан
-- Операція 1
SELECT * 
FROM Loc;

-- Операція 2
INSERT INTO Loc 
VALUES (7,'NEW DEPARTMENT');

-- Операції переходу в кінцевий стан - Скасування.
ROLLBACK;

-- Транзакція 2 складається із двох послідовних операцій
-- та операції переходу в кінцевий стан
-- Операція 1
SELECT * FROM Loc;

-- Операція 2
INSERT INTO Loc 
VALUES (7,'BERLIN');

-- Операції переходу до кінцевого стану - Фіксація.
COMMIT;
