/*
	5.1 Для однієї з таблиць, що містить обмеження цілісності зовнішнього ключа, 
	виконати команду зміни значення колонки зовнішнього ключа на значення, яке відсутнє в колонці
	первинного ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
*/

UPDATE room 
    SET hostel_id = 10 
    WHERE room_id = 2;

-- ORA-02291: integrity constraint (SYECHYN.ROOM_FK) violated - parent key not found

/*
	5.2 Повторити рішення завдання 5.1, але таке, 
	що не призводить до порушення цілісності зовнішнього ключа.
*/

UPDATE room 
    SET hostel_id = 2 
    WHERE room_id = 2;

/*
	5.3 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, 
	пов'язане з колонкою зовнішнього ключа іншої таблиці, 
	виконати одну команду видалення рядка зі значенням колонки первинного ключа, 
	що є в колонці зовнішнього ключа іншої таблиці. Перевірити реакцію СКБД видалення.
*/

DELETE FROM hostel
    WHERE hostel_id = 1;
-- ORA-02292: integrity constraint (SYECHYN.ROOM_FK) violated - child record found

/*
	5.4 Повторити рішення завдання 5.3, але таке, 
	що не призводить до порушення цілісності зовнішнього ключа.
*/

ROLLBACK;
DELETE FROM hostel
    WHERE hostel_id = 2;

/*
	5.5 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, 
	виконати команду зміни значення колонки первинного ключа на значення, 
	яке присутнє у колонці зовнішнього ключа відповідної таблиці. 
	Перевірити реакцію СКБД на таку зміну.
*/

UPDATE hostel
    SET hostel_id = 10
    WHERE hostel_id = 1;
-- ORA-02292: integrity constraint (SYECHYN.ROOM_FK) violated - child record found

/*
	5.6 Повторити рішення завдання 5.5, але таке, 
	що не призводить до порушення цілісності зовнішнього ключа, 
	тобто виконати команду зміни значення колонки первинного ключа на значення, 
	яке вже не присутнє у колонці зовнішнього ключа відповідної таблиці.
*/

UPDATE hostel
    SET hostel_id = 10
    WHERE hostel_id = 2;
    
