/* 
Приклади SELECT-команд з агрегацією даних
*/

/*
Агрегатні функції:
- діють на наборі рядків
– дають єдиний результат для набору.

Типи агрегатних функцій:
AVG – середнє значення
COUNT – кількість записів
MAX – максимальне значення
MIN – мінімальне значення
SUM – сума значень
*/

-- шаблон  простої SELECT-команди
SELECT column, group_function(column)
FROM table
[WHERE	condition]
[GROUP BY column];

-- Отримання середньої, максимальної, мінімальної зарплат та сум зарплат співробітників
SELECT 
    AVG(sal), 
	MAX(sal), 
	MIN(sal), 
	SUM(sal)
FROM emp;

-- Отримання мінімальної та максимальної дати зарахування співробітників
SELECT 
    MIN(hiredate), 
	MAX(hiredate)
FROM emp;

/*
Агрегатні функції ігнорують значення null у стовпцях.
*/

-- Отримання кількості співробітників, які мають комісійні
SELECT 
    COUNT(comm)
FROM emp;

-- Отримання середнього значення комісійних
SELECT 
    AVG(comm)
FROM emp;

/*
Усі стовпці зі списку SELECT,
що не входять в агрегатні функції,
мають бути у пропозиції GROUP BY.
*/

-- Спроба отримання кількості співробітників окремо по кожному підрозділу
SELECT   
    deptno, 
	COUNT(empno)
FROM emp;

-- Отримання середньої зарплати співробітників у кожному підрозділі
SELECT   
    deptno,
    COUNT(empno)
FROM emp
GROUP BY deptno;

/*
Стовпець, який використовується в пропозиції GROUP BY,
не обов'язково повинен входити до списку SELECT.
*/

-- Отримання списку кількості співробітників у кожному підрозділі
SELECT 
    COUNT(empno)
FROM emp
GROUP BY deptno;

-- Отримання максимальної кількості співробітників у підрозділі
-- Використовується можливість вкладення функцій агрегації
SELECT 
    MAX(COUNT(empno))
FROM emp
GROUP BY deptno;

-- Отримання суми зарплат співробітників у кожному підрозділі окремо за кожною посадою
SELECT 
    deptno, 
	job, 
	SUM(sal)
FROM     emp
GROUP BY deptno, job;

-- Спроба отримання середньої зарплати співробітників у кожному підрозділі,
-- для яких середня зарплата > 2000
SELECT	 
    deptno, 
	AVG(sal)
FROM emp
WHERE	
    AVG(sal) > 2000
GROUP BY deptno;

-- Отримання середньої зарплати співробітників у кожному підрозділі,
-- для яких середня зарплата > 2000
SELECT	 
    deptno, 
	AVG(sal)
FROM emp
GROUP BY deptno
HAVING 
    AVG(sal) > 2000;
