/*
	6.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці.
*/

SELECT COUNT (student_id)
    FROM student;
/*

	COUNT(STUDENT_ID)
1	4

*/

/*
	6.2 Для однієї з таблиць створити команду отримання суми значень однієї з цілих колонок.
*/

SELECT SUM (area)
    FROM room;

/*

	SUM(AREA)
1	151

*/

/*
	6.3 Для однієї з таблиць створити команду 
	отримання статистики появи значень однієї з колонок у таблиці, наприклад:
	- значення 1, кількість появи значення 1
	- значення 2, кількість появи значення 2
*/

SELECT room_id, COUNT(*)
    FROM student
    GROUP BY room_id;

/*

	ROOM_ID		COUNT(*)
1	1			2
2	2			2

*/

/*
	6.4 Модифікувати рішення попереднього завдання так, 
	щоб у відповіді були відфільтровані рядки з урахуванням заданої умови, 
	що включає використану функцію агрегації.
*/

SELECT amount_of_windows, COUNT(*)
    FROM room
    GROUP BY amount_of_windows
    HAVING COUNT(*) > 0;

/*
	AMOUNT_OF_WINDOWS	COUNT(*)
1	1					1
2	3					1

*/