
/*
	5.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці, 
	згрупованих по одній з колонок, яка також повинна бути отримана, 
	об'єднавши її з командою отримання загальної кількості рядків 
	із зазначенням слова «Разом:», наприклад:
		Колонка 	Кількість
		значення1 	10
		значення2 	15
		Разом: 		25

	При виконанні завдання необхідно врахувати, 
	що підсумковий рядок завжди повинен бути останнім, 
	незалежно від значень колонки у попередніх рядках.
*/

SELECT
    faculty,
    COUNT(faculty)
    FROM student
    GROUP BY faculty
    UNION ALL
    SELECT
        'Разом: ',
        COUNT(*)
        FROM student;

/*
	FACULTY				COUNT(FACULTY)
1	Computer science	2
2	Cyber security		1
3	Design				2
4	Game Dev			2
5	Разом: 				7
*/